On the given dataset perform the following tasks :
1. Clean the data
2. Normalize any required columns
3. Encode the categorical data [ use label encoding only for simplicity ]
4. Divide the data into train test split after separating the features from label
5. Train a decision tree [ Sk Learn ] and calculate its score using score() [ find in decision tree documentation of Sk Learn ]

In [43]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [183]:
import pandas as pd       
import numpy as np 
from sklearn.preprocessing import LabelEncoder
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import cross_val_score
from sklearn.tree import DecisionTreeClassifier

In [184]:
path = '/content/drive/MyDrive/Data/data.csv'
df = pd.read_csv(path)

In [185]:
df.head()

   passenger_id  pclass  ...                 home.dest survived
0          1216       3  ...                       NaN        1
1           699       3  ...                   Croatia        0
2          1267       3  ...                       NaN        0
3           449       2  ...      Cornwall / Akron, OH        1
4           576       2  ...  Barre, Co Washington, VT        0

[5 rows x 15 columns]

In [33]:
df.describe()

       passenger_id     pclass         age  ...        fare        body    survived
count    850.000000  850.00000  676.000000  ...  849.000000   73.000000  850.000000
mean     662.816471    2.32000   29.519847  ...   34.012701  165.821918    0.368235
std      380.751936    0.83853   14.562243  ...   53.705779   99.068487    0.482610
min        1.000000    1.00000    0.166700  ...    0.000000    4.000000    0.000000
25%      332.250000    2.00000   20.000000  ...    7.895800   75.000000    0.000000
50%      676.500000    3.00000   28.000000  ...   14.108300  166.000000    0.000000
75%      992.250000    3.00000   37.000000  ...   31.000000  260.000000    1.000000
max     1307.000000    3.00000   80.000000  ...  512.329200  328.000000    1.000000

[8 rows x 8 columns]

In [186]:
df.isnull().sum()

passenger_id      0
pclass            0
name              0
sex               0
age             174
sibsp             0
parch             0
ticket            0
fare              1
cabin           659
embarked          1
boat            542
body            777
home.dest       386
survived          0
dtype: int64

In [187]:
df.drop(['name','ticket','cabin','boat','body','home.dest','fare'],axis=1,inplace=True)
df

     passenger_id  pclass     sex   age  sibsp  parch embarked  survived
0            1216       3  female   NaN      0      0        Q         1
1             699       3    male  38.0      0      0        S         0
2            1267       3  female  30.0      1      1        S         0
3             449       2  female  54.0      1      3        S         1
4             576       2    male  40.0      0      0        S         0
..            ...     ...     ...   ...    ...    ...      ...       ...
845           158       1    male  55.0      0      0        S         0
846           174       1    male  58.0      0      0        C         0
847           467       2  female  24.0      1      0        S         1
848          1112       3  female   3.0      1      1        S         0
849           425       2    male  52.0      0      0        S         0

[850 rows x 8 columns]

In [188]:
label_encoder =LabelEncoder()
df['sex']= label_encoder.fit_transform(df['sex'])
df

     passenger_id  pclass  sex   age  sibsp  parch embarked  survived
0            1216       3    0   NaN      0      0        Q         1
1             699       3    1  38.0      0      0        S         0
2            1267       3    0  30.0      1      1        S         0
3             449       2    0  54.0      1      3        S         1
4             576       2    1  40.0      0      0        S         0
..            ...     ...  ...   ...    ...    ...      ...       ...
845           158       1    1  55.0      0      0        S         0
846           174       1    1  58.0      0      0        C         0
847           467       2    0  24.0      1      0        S         1
848          1112       3    0   3.0      1      1        S         0
849           425       2    1  52.0      0      0        S         0

[850 rows x 8 columns]

In [189]:
df.dropna(inplace=True)
df

     passenger_id  pclass  sex   age  sibsp  parch embarked  survived
1             699       3    1  38.0      0      0        S         0
2            1267       3    0  30.0      1      1        S         0
3             449       2    0  54.0      1      3        S         1
4             576       2    1  40.0      0      0        S         0
5            1083       3    1  28.0      0      0        S         0
..            ...     ...  ...   ...    ...    ...      ...       ...
845           158       1    1  55.0      0      0        S         0
846           174       1    1  58.0      0      0        C         0
847           467       2    0  24.0      1      0        S         1
848          1112       3    0   3.0      1      1        S         0
849           425       2    1  52.0      0      0        S         0

[675 rows x 8 columns]

In [190]:
df=pd.get_dummies(df,drop_first=True)
df

     passenger_id  pclass  sex   age  ...  parch  survived  embarked_Q  embarked_S
1             699       3    1  38.0  ...      0         0           0           1
2            1267       3    0  30.0  ...      1         0           0           1
3             449       2    0  54.0  ...      3         1           0           1
4             576       2    1  40.0  ...      0         0           0           1
5            1083       3    1  28.0  ...      0         0           0           1
..            ...     ...  ...   ...  ...    ...       ...         ...         ...
845           158       1    1  55.0  ...      0         0           0           1
846           174       1    1  58.0  ...      0         0           0           0
847           467       2    0  24.0  ...      0         1           0           1
848          1112       3    0   3.0  ...      1         0           0           1
849           425       2    1  52.0  ...      0         0           0           1

[675 rows x 9 columns]

In [191]:
x=df.iloc[:,:-1].values
x.shape

(675, 8)

In [192]:
y=df.iloc[:,-1].values
y.shape

(675,)

In [193]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.25 , random_state=5)

In [194]:
x_train.shape

(506, 8)

In [195]:
x_test.shape

(169, 8)

In [196]:
y_train.shape

(506,)

In [197]:
y_test.shape

(169,)

In [198]:
lr = LogisticRegression()
lr.fit(x_train, y_train)

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [199]:
y_pred = lr.predict(x_test)

In [200]:
y_test

array([1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0,
       0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1,
       0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1,
       1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1,
       1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1,
       0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1], dtype=uint8)

In [201]:
y_pred

array([1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1], dtype=uint8)

In [202]:
clf = DecisionTreeClassifier(random_state=0)
clf.fit(x_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=0, splitter='best')

In [203]:
score = clf.score(x_test, y_test)
score

0.7455621301775148